<template>
    <div>
        <br>
        <div class="first">
            <h3>Задача 1</h3>
        <span>Текст задачи: <b>У вас есть 8 монет и одни весы с двумя чашами. Одна монета немного тяжелее остальных. Как за два взвешивания найти тяжелую монету?</b></span>
        <h4>Ответ:  <span class="text-red-600"> skip,без гугла решить не смог(</span></h4>
        </div>
        <br>
        <div class="two">
            <h3>Задача 2</h3>
        <span>Текст задачи: <b>Есть числа от трёх до одиннадцати. есть квадрат 3 на 3 клетки
            Можно ли расставить числа в клетки квадрата таким образом,что перемножения чисел в строках даёт тот же результат,что и произведение чисел в столбцах с теми же номерами ?</b></span>
        <h4>Ответ:  <span class="text-red-600">Не получится решить это задание,потому что сетка слишком маленькая,при 3х3 не получится сделать( Дело в том что общая сумма цифр будет 54,54 дробится на 3 3 3 и 2. А нам нужно везде по 3,вообщем не получится имея эти данные.</span></h4>
        </div>
        <br>
        <div class="three">
            <h3>Задача 3</h3>
        <span>Текст задачи: <b>Ученые разработали новый материал неизвестной прочности,они знают что материал разбивается при падении с высоты от 1 метра до 5000 метров. Но не знают с какой именно высоты. Чтобы определить прочность,ученые поднимают предмет на некоторую высоту и сбрасывают его оттуда их задача определить начиная с какой именно высоты предмет начнёт разбиваться.

            Специальная платформа с помощью которой они осуществляют эксперимент,скидывает предмет только с дискретных высот,платформа не может скинуть например с 2,5 метров. При падении с высоты N метров предмет уничтожается. Если же его сбрасывали с высоты ниже N метров то его можно использовать в повторных экспериментах
            
            Нужно абсолютно точно найти ту высоту,начиная с которой предметы разрушаются. Сделать это нужно за минимальное кол-во экспериментов. У Учёных при этом всего 2 предмета,но они абсолютно одинаковые. Каким образом этого можно достигнуть ? Сколько экспериментов при этом максимально потребуется ?</b></span>
        
                     
        <h4>Ответ:  <span class="text-red-600">Думаю стоит начать кидать (зачем вообще такое делать если только 2 материала ? :/ Но допустм Так надо.) с высоты в 1000 метров,если предмет цел - повышаем на 500-1000 метров. Если условно предмет сломался на 5000 метров,то берём второй и скидываем с 4000 метров,если предмет цел то скидываем с 4500 метров,смотрим на состояние предмета и оцениваем возможности. Если выглядит хорошо,пускаем его с 4800 метров,если всё так же нормально,то скидываем с 4900 метров. и если и тут всё нормально,то скидываем с 5000 метров и смотрим на ситуацию,если сломался - значит 4800-4900 метров - максимум. +-100m) </span></h4>
        </div>
        <br>
        <div class="four">
            <h3>Задача 4</h3>
        <span>Текст задачи: В университетскую столовую пришли трое студентов купить пирожки.Один хочет купить треть от всех имеющихся пирожков и ещё 2 пирожка.Второй хочет купить четверть и ещё 3 пирожка. А третий хочет купить пятую часть всех пирожков, сколько планируют и ещё 8 пирожков. Если все трое купят столько пирожков, сколько планируют,то в столовой как раз закончатся все пирожки. Сколько пирожков есть в столовой ?<b></b></span>
        <h4>Ответ:  <span class="text-red-600">В столой есть 57 пирожков. первый покупает треть + 2,второй четверть часть + 3 пирожков,третий пятую часть пирожкоов + ещё 8. НОК для 3 4 и 5 будет 60. Я не скрываю,заглядывал в гугл для нахождения НОК. </span></h4>
        </div>
        <br>
    </div>
</template>

<script>
export default {
    setup () {
        

        return {}
    }
}
</script>

<style scoped>

.first{
    display: flex;
    gap:5px;
    border: 3px solid red;
    border-radius: 5px;

}
.two{
    display: flex;
    gap: 5px;
    border: 3px solid blueviolet;
    border-radius: 5px;
}
.three{
    display: flex;
    gap: 5px;
    border: 3px solid blueviolet;
    border-radius: 5px;
}
.four{
    display: flex;
    gap: 5px;
    border: 3px solid red;
    border-radius: 5px;
}

</style>